app/controllers/wishlist_controller.rb

INSERT INTO "wishlistitems" ("created_at", "image", "price", "title", "updated_at", "url", "wishlist_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def add_wishlistitem
    unless current_user
        respond_to do |format|
          format.js { render partial: '/wishlist/fail.js.erb' }
        end
      else

        wishlist = current_user.wishlist.id
        title = params[:title]
        image = params[:image]
        price = params[:price]
        link_url = params[:link_url]

        @wishlistitem = Wishlistitem.create(wishlist_id: wishlist, title: title, image: image, price: price, url: link_url)

SELECT "wishlistitems".* FROM "wishlistitems" WHERE "wishlistitems"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "wishlistitems" WHERE "wishlistitems"."id" = ?  [["id", 2]]
---
    def delete_wishlistitem
       @wishlistitem = Wishlistitem.find(params[:id])
         @wishlistitem.destroy